#include <stdio.h>
#include <locale.h>
int main()
{
	setlocale(LC_ALL, "RUS");
	printf("123\n"); // подзадание 1
	printf("1\n2\n3\n"); // подзадание 2
	printf("\t1\n\t\t2\n\t\t\t3\n"); // подзадание 3
	printf("%d\n\t%d\n\t\t%d\n\t\t\t%d\n", 1, 2, 3, 4); // подзадание 4
	printf("%10.3f\n ", 12.234657); // подзадание 5
	printf("%10.5f\n ", 12.234657); // подзадание 6
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2); // подзадание 7
	printf("Деление %d на %d равно %d\n", 7, 5, 7 / 5); // подзадание 8
	printf("Умножение %d на %d равно %d\n", 2000, 4, 2000 * 4); // подзадание 9
	printf("%e разделить %e равно %e\n ", 5., 2000000., 5. / 2000000); // подзадание 10
}